app/views/houses/_house.html.erb

SELECT COUNT(*) FROM "thermometers"  WHERE "thermometers"."house_id" = $1  [["house_id", 1]]
---
    <h4 style="padding-left: 10px;"><strong><%= link_to house.name, house_thermometers_path(house), title: "Click to see all thermometers at #{house.name}."%></strong> </h4>
      <% if house.thermometers.size > 0 %>