app/controllers/houses_controller.rb

INSERT INTO "houses" ("created_at", "name", "time_zone", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-02-09 15:00:02.093774"], ["name", "Summer home"], ["time_zone", "Eastern Time (US & Canada)"], ["updated_at", "2015-02-09 15:00:02.093774"], ["user_id", 40]]
---
  def create
    @house = current_user.houses.build(house_params)
    if @house.save

DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 17]]
---
  def destroy
    @house.destroy