app/views/layouts/_navigation.html.erb

SELECT "email_lists".* FROM "email_lists"
---
        <ul class="dropdown-menu" role="menu">
          <% EmailList.all.each do |email| %>